[
  {
    "slug":"mybpstation",
    "title":"mybpstation.com",
    "year":2015,
    "image":"assets/img/mybpstation-com.jpg",
    "content":"<p>BP (British Petroleum) Driver Rewards website exist to help United States customers keep track of their driver reward discounts that were earned at the pump, find the nearest gas stations by zip code, take advantage of seasonal promotions, and to learn more about BP Fuels. The primary goals of this website are:</p><ul><li>Drive new BP Driver Reward member signups.</li><li>Promote BP Fuels.</li></ul><h2>Full Stack Developer Role</h2><p>While employed at <a href=\"http://gyro.com/\" target=\"_blank\">Gyro</a>, I had the privilege of working with BP and other 3rd party vendors to make this project a success. My role as a Full Stack Developer is outlined below:</p><ul><li>Back-end and front-end development of the public and member only sections of mybpstation.com for both mobile and desktop experiences (not including the Station Finder). Leveraged the CakePHP MVC framework, HTML5, CSS3, and jQuery to build the site.</li><li>Back-end development of the Driver Rewards registration process, account management, member driving profile, password management, driver reward status, and historical transactions using a 3rd party Loyalty Rewards API.</li><li>Back-end and front-end development of the Give a Reward promotion application. The application allowed current Driver Reward members and BP VISA cardholders to build an email with a live preview containing a custom message to “Gift” 25¢ off per gallon up to three of their friends or family members.</li><li>Back-end and front-end integration of the VISA Offers Platform. This integration allowed Driver Rewards members to link up to 5 BP VISA cards with their Driver Reward account, unlink current VISA cards, or completely un-enroll from the program.</li><li>Back-end development of the BP Station Finder management tool that allowed BP representatives to import or update BP Gas Station locations.</li><li>Worked with 3rd party vendors to implement conversion-tracking scripts.</li><li>Include 301 redirects to redirect traffic of the old site to the new site upon launch.</li></ul><h2>Challenges</h2><ul><li>The site itself was hosted on 8 servers with a load balancer and a global traffic manager. The main challenge I had was deploying code to production and staging environments. Debugging code proved to be difficult and any code change I have made required the code to be redeployed and tested. To circumvent the repetition of uploading code to each server, the team setup automatic deployments each time code was committed to an SVN repository. </li><li>Learning the 3rd party Loyalty Rewards API and the VISA Offers Platform API proved to be a challenge. Both parties provided Functional Design Documents and were available for questions or issues as they arose during the development process.</li><li>One of the requirements of the Give a Reward application development was to send data to a 3rd party vendor for end-to-end testing. I used a PHP library called Faker and wrote a CakePHP Shell script that would seed over a hundred records of data that were sent over for testing.</li></ul><h2>What I Have Learned</h2><ul><li>I understood the importance of a Functional Design Document and written use cases. They were detrimental in the success of this project and would never recommend starting a large-scale project without them.</li><li>I learned what different roles the load balancer, global traffic manager, firewall, VPN tunnels played in server security, disaster recovery, and load balancing.</li><li>I rediscovered how powerful the CakePHP framework is and the importance of why an MVC framework was important for this project. It kept the code organized and made it easy to working simultaneously with my fellow colleagues.</li <li>I learned how to leverage node, npm, and gulp.js to concatenate and minify all front-end code.</li><li>I discovered a tool called BrowserSync that helped me author my CSS and JavaScript code while seeing the changes live in multiple web browsers at once.</li></ul>"
  },
  {
    "slug":"tealeaveshealth",
    "title":"tealeaveshealth.com",
    "year":2015,
    "image":"assets/img/tealeaveshealth-com.jpg",
    "content":"<p>The tealeaveshealth.com website exist to promote the Tea Leaves business intelligence solutions specifically for the healthcare industry. The primary goals of this website are:</p><ul><li>Inform users about the patientology, physicianology, and decisionology solutions.</li><li>Schedule demonstrations.</li></ul><h2>Full Stack Developer Role</h2><p>While employed at <a href=\"http://gyro.com\" target=\"_blank\">Gyro</a>, I had the privilege of working with my colleagues to make this project a success. My role as a Full Stack Developer is outlined below:</p><ul <li>Mobile first front-end development utilizing HTML5, CSS3, and jQuery throughout the entire site build. Minimal PHP code exists only for premises of creating the templates and the contact form functionality.</li><li>Backend Development of the contact form entailed capturing the user’s data and sending an email notification.</li><li>Created a streaming build process to concatenate and minify JavaScript and CSS code, autoprefix browser vendor prefixes, and optimize image file size using Gulp.js</li><li>Utilized Composer to manage PHP development dependencies.</li></ul><h2>Challenges</h2><p>Creating SVGs and applying custom CSS and JavaScript interactions proved to be challenging a task. I did not know some of the peculiarities of working with SVGs. Google and the web development community was a great resource for helping me solve issues as I came across them.</p><h2>What I Have Learned</h2><p>SVGs can be styled and animated through CSS. SVGs are easier to work with if optimized through the SVGO command line utility. SVGs have a subset of CSS properties that are only available to SVGs such as “fill” and “stroke”. JavaScript interactions can also be applied to SVGs. SVG stands for Scalable Vector Graphic which means the graphic never loses quality as it scales up.</p>"
  },
  {
    "slug":"fopconnect",
    "title":"fopconnect.com",
    "year":2014,
    "image":"assets/img/fopconnect-com.png",
    "url":"http://www.fopconnect.com/",
    "content":"<p>FOPConnect features online content derived from the FOP Journal quarterly magazine intended for members of the National Fraternal Order of Police (NFOP). The goals of this website were to:</p><ul><li>Build an online social community to connect members of the NFOP.</li><li>Offer exclusive content to members of the NFOP.</li <li>Provide content on small screen devices.</li><li>Offer NFOP members a chance to win during limited time sweepstakes.</li><li>Sell advertising space for law enforcement related advertisers.</li><li>Collect opt-ins for e-newsletter distribution through website membership signup.</li></ul><h2>Full Stack Developer Role</h2><ul <li>Front-end development of a WordPress theme incorporating responsive layout techniques.</li><li>Back-end development of PHP scripts to transfer over 50,000 NFOP members from PHPFox to the WordPress CMS.</li><li>Back-end development of a verification system that verified users who register or login into fopconnect.com against a separate database containing valid members of the NFOP.</li><li>Back-end developement of a reporting application that allowed membership data based on chosen criteria(s) to be downloaded from the WordPress database.</li><li>Performed periodic website updates and create various quarterly HTML e-newsletters.</li></ul><h2>Challenges</h2><ul <li>Picking the right CMS. Compared WordPress, Joomla, and Drupal. Chose WordPress because of its large community and support.</li><li>Learning WordPress theme development. Relied on the WordPress Codex.</li><li>Researching actively developed plugins that included functionality that complemented the goals of the website. Made great use of WordPress plugin repository and WPMUDEV.</li><li>Familiarizing myself with all of the filters and actions to customize WordPress functionality and output. Relied on the WordPress Codex.</li <li>Incorporating Twitter Bootstrap CSS framework into my workflow and creating the responsive theme. Understood how it all worked by relying on the Twitter Bootsrap documentation.</li><li>Serving ads using Google DoubleClick for Publishers (DFP) to a responsive website. Discovered I could serve ads using the Non-JavaScript method. This allowed me make use of the max-width CSS property to automatically resize the ads on small devices.</li><li>Learning Sass functions, mixins, variables, placeholder, extends and import functions during the development the website. Relied on the documentation.</li><li>Verifying member signups and logins against an extra database layer. Used various WordPress and BuddyPress hooks to query the databases and to verify users who are members of the NFOP. Used MySQL prepared statements for extra security.</li><li>Learning PHPFox and WordPress database schema in order to develop a PHP script that transfered existing members from PHPFox to WordPress. Relied on PHPMyAdmin to study the tables primary and foriegn key relationships in both systems.</li><li>Managing member e-newsletter opt-ins through BuddyPress custom profile fields. The opt-in's were not managed by a 3rd party solution such as MailChimp, iContact, or Constant Contact. The solution was to build a custom reporting app that exported users based on what e-newsletters they were subcribed to. The list was then used for e-newsletter distribution.</li></ul><h2>What I Have Learned</h2><ul <li>Criterias that should be considered while choosing a CMS such as documentation, user and developer community, open source versus commercial and overal acceptance.</li <li>WordPress theme development including the understanding of the template hiearchy, template tags, filters, and actions.</li><li>Twitter Bootstrap CSS Framework. After, I have finished the project I realized this framework included a lot of unused CSS which created a lot of bloat. This caused to me learn what makes a website responsive and to build <a href=\"https://github.com/chriswoodley/style-guide\" title=\"chriswoodley/style-guide Âˇ GitHub\" target=\"_blank\">my own responsive pattern library</a>.</li><li>Basic knowledge Sass. I also learned that I shouldn't nest my CSS selectors more the three levels deep due to maintenance, bloat, and specificity issues.</li><li>Google DFP Ad server and how to serve the ads onto the website. Responsive ad units at the time were non-existent. However, I discovered a non-JavaScript method to serving the ads which allowed me make use of the max-width CSS property.</li></ul><p>In closing, this was one of my favorite projects to work on since I was able to level up my skills by diving deep into real world problems surrounding mobile and desktop experience. In the end, I ended up re-developing the website using my own pattern library taking into account all of the things I have learned the first time I have developed it.</p>"
  },
  {
    "slug":"elcajonpoa",
    "title":"elcajonpoa.org",
    "year":2013,
    "image":"assets/img/elcajonpoa-org.png",
    "url":"http://elcajonpoa.org/",
    "content":"<p>El Cajon Police Association website represents the men and women of the El Cajon Police Department who protect and serve the community every day. The goals of the website are:</p><ul><li>Inform visitors of the various donation, sponsorship, and charitable opportunities they can get involved with to help protect the pay, benefits, and working conditions of the El Cajon Police Offers’.</li><li>Provide up to date News and Upcoming Events</li><li>Honor the fallen heroes</li><li>Provide an easy way to connect and communicate with the association through it's Board of Directors</li></ul><h2>Front-End Developer Role</h2><ul><li>Front-end WordPress theme development incorporating HTML5, CSS3, jQuery, PHP, and responsive layout.</li><li>Developed a feed plugin to display feed items from odmp.org.</li><li>Responsible for build out and visual layout of the content.</li><li>Performed periodic website updates.</li></ul><h2>Challenges</h2><ul><li>Cross device compatibility. Utilized the proven CSS Bootstrap Framework.</li><li>Browser Testing. Performed browser testing using Browser Stack. Used polyfills for less capable browsers.</li></ul><h2>What I Have Learned</h2><p>I have discovered the respond.js and selectvzr.js polyfill. These polyfills made media queries and CSS3 selector support possible in less capable browsers such as IE8.</p>"
  },
  {
    "slug":"silverlandusa",
    "title":"silverlandusa.com",
    "year":2010,
    "image":"assets/img/silverlandusa-com.png",
    "url":"http://www.silverlandusa.com/",
    "content":"<p>Silverland Inn &amp; Suites website showcases Specials, Rooms and Suites, Hotel Amenities, Groups and Events, and a City Guide for the primary goal of generating hotel bookings.</p><h2>Full Stack Developer Role</h2><ul><li>Created Photoshop wireframes for the graphic designer to apply the visual design.</li><li>Front-end development of the design utilizing the blueprint CSS framework.</li><li>Used jQuery and jQuery UI libraries to integrate the datepicker widget and form validation into the Reservation form.</li><li>Integrated PHP scripts to interact with the 3rd pary booking API used by the reservation form.</li><li>Relational database design and back-end development of the Special Offers module. This central application was used to create and display scheduled special offers through a RESTful API built with the CakePHP framework. The XML response was handled by PHP's built in SimpleXML class.</li <li>Relational Database design and back-end development of the City Guide module. This module was a part of the same system that the Special Offers module was built upon. Incorporated the Google Maps API to dispay brick and motar establishments within a pre-defined radius centered on the location of Silverland Inn &amp; Suites.</li></ul><h2>Production Manager Role</h2><ul><li>Responsible for delegating tasks to team members in expediting the completion of the website.</li><li>Oversaw periodic website updates that was delegated to team members.</li><li>Performed quality assurance tasks related to the launch of the site.</li></ul><h2>Challenges</h2><ul <li>Most websites had a similar structure and a repetitve code base. I have discovered and introduced frameworks to reduce the buildout time and cost the website.</li <li>One of the challenges associated with blueprint CSS is making sure the final design aligned perfectly with the 24 column grid structure. To solve this problem I overlayed the grid over the wireframe before handing it off to the Graphic Designer. This process made it easy to slice pixel perfect graphics from the final design to code.</li><li>At the time CakePHP was one of the most regarded frameworks and I had no knowledge of Object Oriented Programming or the Model View Controller (MVC) design pattern. Learning the framework required extensive use of their documentation and writing the code I needed to complete the Special Offers and City Guide Modules.</li></ul><h2>What I Have Learned</h2><ul><li>I learned that incorporating frameworks into my workflow can cut development time down. I also learn that its important to know why and how the framework works so troubleshoot or customize the application the way you want to.</li><li>I learned the MVC design pattern including how Routing and URL Rewriting works. Models are used for modeling data which is then passed into the controllers and then outputed to the View. Controllers are also used to pass input into the Models. The purpose of the pattern is to organize logic, data, and output so that your code base is easier to manage and maintain.</li><li>I learned how PHP Classes work including public and private methods and properties and how to access them.</li><li>As a production manager, I learned that team members have their own ways of doing things and I learned to have an open mind.</li></ul>"
  },
  {
    "slug":"cclea",
    "title":"cclea.org",
    "year":2013,
    "image":"assets/img/cclea-org.png",
    "url":"http://cclea.org/",
    "content":"<h2>California Coalition of Law Enforcement Associations website goals include:</h2><ul><li>Exchanging and disseminating information among its member associations.</li><li>Improve law enforcement standards.</li><li>Offer member associations assistance in ways that are relative to affecting their welfare.</li></ul><h2>Front-End Developer Role</h2><ul><li>Front-end WordPress theme development incorporating HTML5, CSS3, jQuery, PHP, and fluid responsive layout.</li><li>Responsible for build out and visual layout of the content.</li><li>Performed periodic website updates.</li></ul><h2>Challenges</h2><ul><li>Cross device compatibility by ensuring the break points are established based on where the content breaks. Relied on Chrome Dev Tools to get viewport widths while establishing those break points.</li></ul><h2>What I Have Learned</h2><ul><li>Not all browsers support CSS3 Media Queries. IE 9 and below needs a polyfill that adds support for CSS3 Media Queries.</li></ul>"
  },
  {
    "slug":"iodlawyers",
    "title":"iodlawyers.com",
    "year":2014,
    "image":"assets/img/iodlawyers-com.png",
    "url":"http://iodlawyers.com/",
    "content":"<p>Straussner Sherman website boasts capabilities of the Law Firm in providing legal services to safety members and their families. The website primary goals were to:</p><ul><li>Establish an online presence for generating new business.</li><li>Offer information about the capabilities of the firm.</li><li>Provide legal resources and informative articles regarding Workers' Compensation.</li></ul><h2>Front-End Developer Role</h2><ul><li>Front-end WordPress theme development incorporating HTML5, CSS3, jQuery, PHP, and fluid responsive layout.</li><li>Use tools like Sass and CodeKit to  organize and compile minified CSS code.</li><li>Browser test front-end code with Firefox, Chrome, and Internet Explorer 8 and above.</li><li>Responsible for the build out and visual layout of the content.</li><li>Performed periodic website updates.</li></ul><h2>Challenges</h2><ul><li>Using proper CSS fallbacks for non-supported CSS3 properties. Relied heavily on caniuse.com for a list of supported browser features.</li><li>Testing front-end code in all browsers. Browserstack.com was the tool that was used to test the website in various operating systems and web browser combinations.</li></ul><h2>What I Have Learned</h2><ul><li>The math behind crafting responsive CSS code (target width / context width = relative width).</li><li>Using polyfills to add support for non-supported CSS3 properties, such as html5shiv, selectivizr, respond.js to make ie8 understand media queries.</li></ul>"
  },
  {
    "slug":"azplea",
    "title":"azplea.com",
    "year":2014,
    "image":"assets/img/azplea-com.png",
    "url":"http://azplea.com/",
    "content":"<p>The Phoenix Law Enforcement Association website aims to promote the positive role of the police profession by protecting and securing members’ rights. The goals of this website were to:</p><ul><li>Provide information regarding the capabilities of the association to the public.</li><li>Act as a conduit for charities and donations</li><li>Honor the fallen heroes</li><li>Syndicate latest news regarding legislative initiatives and contract negotiations</li><li>Offer members training &amp; classes, tickets &amp; discounts, and other pertinent information that is only available to them.</li></ul><h2>Front-End Developer Role</h2><ul <li>Front-end WordPress child theme development incorporating HTML5, CSS3, jQuery, and PHP.</li><li>Integrate various plugins for the members only area, setup Custom Post Types and Custom Post Type templates for various sections of the site.</li><li>Expedited the transfer of content and member data from Joomla CMS to WordPress.</li><li>Performed periodic website updates.</li></ul><h2>Challenges</h2><ul <li>Provide an affordable website package by selecting a pre-built theme. Research was performed during the selection process. During the buildout, the themes developer documentation was crucial in making the necessary modifications needed to produce azplea.com’s branding and functionality.</li></ul><h2>What I Have Learned</h2><ul <li>There are always options/variations to provide clients based on their budget.</li></ul>"
  }
]
